[AdvTrainingOfficerM1 X2CharacterTemplate]
strCharacterName="训练官"

[AdvTrainingOfficerM2 X2CharacterTemplate]
strCharacterName="高级训练官"

[AdvTrainingOfficerM3 X2CharacterTemplate]
strCharacterName="精英训练官"


[AdventFieldTraining X2SitRepTemplate]
FriendlyName="变种人训练演习"
Description="变种人正在该地区进行训练演习。"

[AdventFieldTrainingEffect X2SitRepEffect_ModifyDefaultEncounterLists]
FriendlyName="变种人训练演习"
Description="变种人正在利用这次机会训练一些新兵。战场上可能会有多名训练官与新招募的变种人士兵一起。这可能正是派遣我们的一些新兵去获取一些战场经验的最佳时机，指挥官。"


[TrainingInfluenceM1 X2AbilityTemplate]
LocFriendlyName="影响力"
LocHelpText="训练官可以利用他的影响力来增强等级较低的变种人士兵。这些单位将获得移动性、攻击力和防御力的属性提升。"
LocLongDescription="训练官可以利用他的影响力来增强等级较低的变种人士兵。这些单位将获得移动性、攻击力和防御力的属性提升。"
LocFlyOverText="坚守阵地，记住你们的训练！！"

[TrainingInfluenceM2 X2AbilityTemplate]
LocFriendlyName="影响力"
LocHelpText="训练官可以利用他的影响力来增强等级较低的变种人士兵。这些单位将获得移动性、攻击力和防御力的属性提升。"
LocLongDescription="训练官可以利用他的影响力来增强等级较低的变种人士兵。这些单位将获得移动性、攻击力和防御力的属性提升。"
LocFlyOverText="坚守阵地，记住你们的训练！！"

[TrainingInfluenceM3 X2AbilityTemplate]
LocFriendlyName="影响力"
LocHelpText="训练官可以利用他的影响力来增强等级较低的变种人士兵。这些单位将获得移动性、攻击力和防御力的属性提升。"
LocLongDescription="训练官可以利用他的影响力来增强其他等级较低的变种人士兵。这些单位将获得移动性、攻击力和防御力的属性提升。"
LocFlyOverText="准备好，一步不退！！"

[CallAdvInTrainingM1 X2AbilityTemplate]
LocFriendlyName="变种人增援"
LocLongDescription="召唤变种人增援。"
LocHelpText="召唤变种人增援。"
LocFlyOverText="给我派遣更多新兵！"

[CallAdvInTrainingM2 X2AbilityTemplate]
LocFriendlyName="变种人增援"
LocLongDescription="召唤变种人增援。"
LocHelpText="召唤变种人增援。"
LocFlyOverText="给我派遣更多新兵！"

[CallAdvInTrainingM3 X2AbilityTemplate]
LocFriendlyName="变种人增援"
LocLongDescription="召唤变种人增援。"
LocHelpText="召唤变种人增援。"
LocFlyOverText="给我派遣更多新兵！"